In [1]:
!pip install pandas

Requirement already satisfied: pandas in /home/hulk/anaconda3/lib/python3.8/site-packages (1.2.4)
Requirement already satisfied: python-dateutil>=2.7.3 in /home/hulk/anaconda3/lib/python3.8/site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.16.5 in /home/hulk/anaconda3/lib/python3.8/site-packages (from pandas) (1.19.2)
Requirement already satisfied: pytz>=2017.3 in /home/hulk/anaconda3/lib/python3.8/site-packages (from pandas) (2020.1)
Requirement already satisfied: six>=1.5 in /home/hulk/anaconda3/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [4]:
import pandas as pd

In [ ]:
# pandas has 2 datastructure 

1. Series - 1d
2. Dataframe - 2d

In [ ]:
# Series

# how to create a series

In [3]:
# 1. list

stu_name = ['aitesam','bhrgav','gurprett', 'Harini']

In [5]:
pd.Series(stu_name)

0     aitesam
1      bhrgav
2    gurprett
3      Harini
dtype: object

In [8]:
pd.Series(stu_name , index = ['a','b','c','d'])

a     aitesam
b      bhrgav
c    gurprett
d      Harini
dtype: object

In [11]:
# 1. list

stu_name = ('aitesam','bhrgav','gurprett', 'Harini')
a = pd.Series(stu_name)

In [12]:
a.ndim

1

In [13]:
# dic
dic = {'a':1 , 'b':3, 'c':4}
a = pd.Series(dic)

In [14]:
a

a    1
b    3
c    4
dtype: int64

In [17]:
dic = {'a':1 , 'b':3, 'c':4}
a = pd.Series(dic , index = [1,2,3,'a'])

In [18]:
a

1    NaN
2    NaN
3    NaN
a    1.0
dtype: float64

In [21]:
import numpy as np
type(np.nan)

float

In [ ]:
# indexing and slicing

indexing can be done in 2 ways

- by giving the custom index
- by giving the zero index

In [22]:
a

1    NaN
2    NaN
3    NaN
a    1.0
dtype: float64

In [25]:
stu_name = ('aitesam','bhrgav','gurprett', 'Harini')
a = pd.Series(stu_name, index = ['a','b','c','d'])

In [26]:
a

a     aitesam
b      bhrgav
c    gurprett
d      Harini
dtype: object

In [27]:
a[2]

'gurprett'

In [28]:
a['c']

'gurprett'

In [ ]:
# slicing

- by giving the custom index
- by giving the zero index

In [29]:
a

a     aitesam
b      bhrgav
c    gurprett
d      Harini
dtype: object

In [30]:
a[0:3]

# 0 inculive
# 3 exculive

a     aitesam
b      bhrgav
c    gurprett
dtype: object

In [31]:
a

a     aitesam
b      bhrgav
c    gurprett
d      Harini
dtype: object

In [32]:
a['a':'c']

# a inculive
# c inculive

a     aitesam
b      bhrgav
c    gurprett
dtype: object

In [33]:
brics_country = ['Brazil', 'Russia', 'India', 'China', 'South Africa']
brics_currency = ['Real', 'Ruble', 'Rupee', 'Renminbi', 'Rand' ]

In [34]:
brics = pd.Series(brics_country, index=brics_currency)

In [35]:
brics

Real              Brazil
Ruble             Russia
Rupee              India
Renminbi           China
Rand        South Africa
dtype: object

In [36]:
brics.index

Index(['Real', 'Ruble', 'Rupee', 'Renminbi', 'Rand'], dtype='object')

In [37]:
brics.values

array(['Brazil', 'Russia', 'India', 'China', 'South Africa'], dtype=object)

In [38]:
# Dataframe

pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [ ]:
# how to create a dataframe

In [39]:
pwd

'/home/hulk/Afsan/tutort/december_4_batch_tutort'

In [41]:
ls

 architecture.png
 class_1_intro.ipynb*
 class_2_int_float_bool_None_str.ipynb*
 class_3_output_fn_format_strings_float_Bool_complex_None.ipynb
 class_4_strings.ipynb
 class_5_string_part_2.ipynb
 class_7_break_continue_functions_module.ipynb
 class_list_part_2_tuple.ipynb
 datasets/
'dic_part_2_conditional statements_loops.ipynb'
 numpy_part_1.ipynb
 numpy_part_1.zip
 numpy_part_2.ipynb
 pandas_part_1.ipynb

# how to create a dataframe

In [42]:
# 1. loading a file

df = pd.read_csv('datasets/ted_data.csv')
df

,name_speaker,speaker_occupation,title,views,comments
0,Ken Robinson,Author/educator,Do schools kill creativity?,47227110,4553
1,Al Gore,Climate advocate,Averting the climate crisis,3200520,265
2,David Pogue,Technology columnist,Simplicity sells,1636292,124
3,Majora Carter,Activist for environmental justice,Greening the ghetto,1697550,200
4,Hans Rosling,Global health expert; data visionary,The best stats you've ever seen,12005869,593
5,Tony Robbins,Life coach; expert in leadership psychology,Why we do what we do,20685401,672
6,Julia Sweeney,"Actor, comedian, playwright",Letting go of God,3769987,919
7,Joshua Prince-Ramus,Architect,Behind the design of Seattle's library,967741,46
8,Dan Dennett,"Philosopher, cognitive scientist",Let's teach religion -- all religion -- in sch...,2567958,582
9,Rick Warren,"Pastor, author",A life of purpose,3095993,900

In [43]:
df = pd.read_excel('datasets/football_worldcup.xlsx')
df

   Year       Country    Winner   Runners-Up  GoalsScored  MatchesPlayed
0  1990         Italy  Germany     Argentina          115             52
1  1994           USA    Brazil        Italy          141             52
2  1998        France    France       Brazil          171             64
3  2002         Japan    Brazil      Germany          161             64
4  2006       Germany     Italy       France          147             64
5  2010  South Africa     Spain  Netherlands          145             64
6  2014        Brazil   Germany    Argentina          171             64

In [44]:
# creating a dataframe using dic

df_dict = {'Year' : [1990, 1994, 1998, 2002],
           'Country' : ['Italy', 'USA', 'France', 'Japan'],
           'Winner' : ['Germany', 'Brazil', 'France', 'Brazil'],
           'GoalScored' : [115, 141, 171, 161]
          }

df = pd.DataFrame(df_dict)
df

   Year Country   Winner  GoalScored
0  1990   Italy  Germany         115
1  1994     USA   Brazil         141
2  1998  France   France         171
3  2002   Japan   Brazil         161

In [45]:
df_dict = {'Year' : [1990, 1994, 1998, 2002,2004],
           'Country' : ['Italy', 'USA', 'France', 'Japan'],
           'Winner' : ['Germany', 'Brazil', 'France', 'Brazil'],
           'GoalScored' : [115, 141, 171, 161]
          }

df = pd.DataFrame(df_dict)
df

ValueError: arrays must all be same length

In [46]:
# 3. uisng series with dic
df_dict = {'Year' : pd.Series([1990, 1994, 1998, 2002,2004]),
           'Country' : pd.Series(['Italy', 'USA', 'France', 'Japan']),
          }

df = pd.DataFrame(df_dict)
df

   Year Country
0  1990   Italy
1  1994     USA
2  1998  France
3  2002   Japan
4  2004     NaN

In [49]:
# 4list of tuple
df_lotuples = [(2002, 'Japan', 'Brazil', 161), 
                (2006, 'Germany', 'Italy', 147), 
                (2010, 'South Africa', 'Spain', 145),
                (2014, 'Brazil', 'Germany', 171)
              ]

pd.DataFrame(df_lotuples, columns=['year','country','wining country','goal'])

   year       country wining country  goal
0  2002         Japan         Brazil   161
1  2006       Germany          Italy   147
2  2010  South Africa          Spain   145
3  2014        Brazil        Germany   171

In [50]:
df_lotuples = [(2002, 'Japan', 'Brazil'), 
                (2006, 'Germany', 'Italy', 147), 
                (2010, 'South Africa', 'Spain', 145),
                (2014, 'Brazil', 'Germany', 171)
              ]

pd.DataFrame(df_lotuples, columns=['year','country','wining country','goal'])

   year       country wining country   goal
0  2002         Japan         Brazil    NaN
1  2006       Germany          Italy  147.0
2  2010  South Africa          Spain  145.0
3  2014        Brazil        Germany  171.0

In [51]:
# 5. list of dic
df_lodict = [
             {'year' : 2002, 'HostCountry' : 'Japan', 'Winner' : 'Brazil'},
             {'year' : 2006, 'HostCountry' : 'Germany', 'Winner' : 'Italy'},
             {'year' : 2010, 'HostCountry' : 'South Africa', 'Winner' : 'Spain'},
             {'year' : 2014, 'HostCountry' : 'Brazil', 'Winner' : 'Germany'},
            ]

pd.DataFrame(df_lodict)

   year   HostCountry   Winner
0  2002         Japan   Brazil
1  2006       Germany    Italy
2  2010  South Africa    Spain
3  2014        Brazil  Germany

In [52]:
# pandas bacis

In [54]:
weather = pd.read_csv('datasets/weather_data.csv')
weather

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [55]:
weather.shape

(6, 4)

In [58]:
# head

weather.head() # deafult is 5

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [59]:
# tail

weather.tail() # deafult is 5

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [60]:
# info
weather.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          6 non-null      object
 1   temperature  6 non-null      int64
 2   windspeed    6 non-null      int64
 3   event        6 non-null      object
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [61]:
weather.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [62]:
weather.describe(include='object')

             day event
count          6     6
unique         6     3
top     1/4/2017  Snow
freq           1     2

In [63]:
weather.describe(include='all')

             day  temperature  windspeed event
count          6     6.000000   6.000000     6
unique         6          NaN        NaN     3
top     1/4/2017          NaN        NaN  Snow
freq           1          NaN        NaN     2
mean         NaN    30.333333   4.666667   NaN
std          NaN     3.829708   2.338090   NaN
min          NaN    24.000000   2.000000   NaN
25%          NaN    28.750000   2.500000   NaN
50%          NaN    31.500000   5.000000   NaN
75%          NaN    32.000000   6.750000   NaN
max          NaN    35.000000   7.000000   NaN